### There are 2 main Data Structures in Pandas
### 1. Series
### 2. DataFrames

### 1. Series

**Series is a one-dimensional array of any data type(integers, strings, floating point numbers or python objects).**  

**s = pd.Series(data, index = index)**

In [3]:
import pandas as pd
import numpy as np

<h4>1. Creating Series Using Dict

In [17]:
d = {
    'a': 0,
    'b':1,
    'z':25
    }

In [23]:
series1 = pd.Series(d, ['a','b','c','z'])
series1

a     0.0
b     1.0
c     NaN
z    25.0
dtype: float64

<h4>2. Creating Series Using

In [16]:
pd.Series(5,range(4))

a     0.0
b     1.0
c     NaN
z    25.0
dtype: float64

In [12]:
pd.Series(np.random.randn(4),['a','b','c','d'])

a    0.444764
b    0.484719
c   -1.517834
d    2.003766
dtype: float64

In [14]:
pd.Series([1.0,2,3,4],['a','b','c','d'])

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [35]:
s = pd.Series([1.0,1,34,21,23,33])

In [15]:
s.mean()

18.833333333333332

In [16]:
s.median()

22.0

In [17]:
s.max()

34

In [18]:
s.min()

1

In [19]:
s.mode()

0    1
dtype: int64

In [21]:
np.exp(s)

0    2.718282e+00
1    2.718282e+00
2    5.834617e+14
3    1.318816e+09
4    9.744803e+09
5    2.146436e+14
dtype: float64

In [26]:
np.exp(1)

2.718281828459045

In [32]:
np.exp(3)

20.085536923187668

In [33]:
2.71828**34

583448398797725.9

In [36]:
s.dtype

dtype('float64')

In [37]:
s.to_numpy()

array([ 1.,  1., 34., 21., 23., 33.])

In [41]:
s[3] =22

In [42]:
s

0     1.0
1     1.0
2    34.0
3    22.0
4    23.0
5    33.0
dtype: float64

In [51]:
20 in s.values

False

In [56]:
s.get(4)

23.0

In [57]:
s+s

0     2.0
1     2.0
2    68.0
3    44.0
4    46.0
5    66.0
dtype: float64

In [58]:
s /2

0     0.5
1     0.5
2    17.0
3    11.0
4    11.5
5    16.5
dtype: float64

In [59]:
s **2

0       1.0
1       1.0
2    1156.0
3     484.0
4     529.0
5    1089.0
dtype: float64

In [61]:
s[1:]

1     1.0
2    34.0
3    22.0
4    23.0
5    33.0
dtype: float64

In [62]:
s[:-1]

0     1.0
1     1.0
2    34.0
3    22.0
4    23.0
dtype: float64

In [63]:
s[1:] + s[:-1]

0     NaN
1     2.0
2    68.0
3    44.0
4    46.0
5     NaN
dtype: float64

In [64]:
s

0     1.0
1     1.0
2    34.0
3    22.0
4    23.0
5    33.0
dtype: float64

In [69]:
s = pd.Series(np.random.randn(5),name='india')

In [70]:
s

0    1.501680
1    0.266851
2    0.577086
3    1.107721
4    1.504050
Name: india, dtype: float64

In [71]:
s.name

'india'

In [74]:
s.rename('ireland',inplace=True)

0    1.501680
1    0.266851
2    0.577086
3    1.107721
4    1.504050
Name: ireland, dtype: float64

In [75]:
s

0    1.501680
1    0.266851
2    0.577086
3    1.107721
4    1.504050
Name: ireland, dtype: float64

### 2.DataFrame

2 Dimensional data structure with columns of same or different types. This is very similar to SQL tables, Spreadsheet tables, or a dictionary of series objects. We can form dataframe from

1. Dict of ndarrays, lists, dicts, series
2. 2D numpy.ndarray
3. structured ndarray
4. A series
5. Another dataframe

#### 1. From dict of series or dicts

In [76]:
d = {
    "Virat": pd.Series([12,112,34,43],index = ['one','two','three','four']),
    "Steve": pd.Series([73,4,33],index = ['one','two','three'])
    
}

In [80]:
df = pd.DataFrame(d)

In [96]:
df = df.loc[['one','two','three','four']]

In [97]:
df

       Virat  Steve
one       12   73.0
two      112    4.0
three     34   33.0
four      43    NaN

In [100]:
pd.DataFrame(d,index=['one','two','three'])

       Virat  Steve
one       12     73
two      112      4
three     34     33

In [103]:
pd.DataFrame(d,index=['one','two','three'],columns=['Virat','Sachin'])

       Virat Sachin
one       12    NaN
two      112    NaN
three     34    NaN

In [104]:
df.index

Index(['one', 'two', 'three', 'four'], dtype='object')

In [105]:
df.columns

Index(['Virat', 'Steve'], dtype='object')

#### 1. From dict of ndarrays/lists

In [106]:
d = {
    'Countries':['India','UK','Iran'],
    'Population':[1.3,0.01,0.015]
    
}

In [110]:
pd.DataFrame(d)

  Countries  Population
0     India       1.300
1        UK       0.010
2      Iran       0.015

In [111]:
pd.DataFrame(d,index=[5,6,7])

  Countries  Population
5     India       1.300
6        UK       0.010
7      Iran       0.015

In [114]:
np.zeros((2,))

array([0., 0.])